Revit 2026 API

# UVGetLength Method

---

The length of this 2-D vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetLength()
```
```vb
Public Function GetLength As Double
```
```cpp
public:
double GetLength()
```
```fsharp
member GetLength : unit -> float
```

#### Return Value

Double

In 2-D Euclidean space, the length of the vector is the square root of the sum of the two coordinates squared.

#### Reference

UV Class

Autodesk.Revit.DB Namespace